In [30]:
#!pip install ipython-sql
%load_ext sql
#!pip install --upgrade psycopg2

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [92]:
%sql postgresql://postgres:123@localhost/my_base

In [88]:
%sql postgresql://postgres:123@localhost/sql_2

##### Interview question 1
## How to find duplicates #1

In [16]:
%sql SELECT department_id, COUNT(*)  FROM employees GROUP BY department_id HAVING COUNT(*) > 1

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
2 rows affected.

[(100, 4), (103, 3)]

## How to find duplicates #2 (List)

In [54]:
%%sql SELECT e1.emp_id, emp_name, e1.department_id
FROM employees e1
INNER JOIN
(SELECT department_id FROM employees GROUP BY department_id HAVING COUNT(*) > 1) e2
ON e1.department_id = e2.department_id

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
7 rows affected.

[(2, 'Anar', 100),
 (3, 'Michael', 100),
 (4, 'Susan', 103),
 (6, 'Doe', 100),
 (8, 'Johnson', 100),
 (9, 'Lee', 103),
 (1, 'Keli', 103)]

## Let's pull weekly trended session volume and compare to gsearch nonbrand. So I can get a sense for a business.

In [50]:
%%sql SELECT
w.device_type, w.utm_source,
COUNT(DISTINCT w.website_session_id) AS sessions,
COUNT(DISTINCT o.order_id) AS orders,
ROUND(CAST(COUNT(DISTINCT o.order_id) AS NUMERIC)/COUNT(DISTINCT w.website_session_id), 3) AS convertion_rate
FROM website_sessions w
LEFT JOIN orders o ON w.website_session_id = o.website_session_id
WHERE w.created_at > '2012-03-19'
AND w.created_at < '2012-04-05'
GROUP BY w.device_type, w.utm_source  ORDER BY 5 DESC

   postgresql://postgres:***@localhost/my_base
 * postgresql://postgres:***@localhost/sql_2
6 rows affected.

[('desktop', 'gsearch', 1462, 65, Decimal('0.044')),
 ('mobile', 'gsearch', 927, 12, Decimal('0.013')),
 ('desktop', 'bsearch', 3, 0, Decimal('0.000')),
 ('desktop', None, 19, 0, Decimal('0.000')),
 ('mobile', 'bsearch', 1, 0, Decimal('0.000')),
 ('mobile', None, 14, 0, Decimal('0.000'))]

## Delete duplicated values

##### Keeps only one row  with the lowest id and deletes the other duplicate rows.

In [35]:
%sql  DELETE FROM employees e1\
USING\
employees e2 WHERE e1.emp_id = e2.emp_id AND e1.emp_id < e2.emp_id; # we are keeping one copy of the duplicated rows

 * postgresql://postgres:***@localhost/my_base
0 rows affected.

[]

##### Keeps the row with the lowest "payment_id" for each distinct "amount" and deletes the others

In [33]:
%sql DELETE FROM payment WHERE payment_id\
NOT IN (SELECT MIN(payment_id) FROM payment GROUP BY amount)

 * postgresql://postgres:***@localhost/my_base
37 rows affected.

[]

## Combine two columns and get the result

In [57]:
%%sql WITH updated_data AS (
  SELECT
    first_name,
    LEFT(first_name, POSITION(' ' IN first_name) - 1) AS new_first_name,
    RIGHT(first_name, LENGTH(first_name) - POSITION(' ' IN first_name) + 1) AS new_last_name
  FROM employee_3
  WHERE last_name = ''
)
UPDATE employee_3 e
SET
    first_name = u.new_first_name,
    last_name = u.new_last_name
FROM updated_data u
WHERE e.first_name = u.first_name;
 
SELECT * FROM employee_3

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
0 rows affected.
8 rows affected.

[(1001, datetime.date(1988, 8, 15), 'ADAM', 'WAUGH', datetime.date(2013, 4, 12)),
 (1002, datetime.date(1990, 5, 10), 'Mark', 'Jennifer', datetime.date(2010, 6, 25)),
 (1003, datetime.date(1992, 2, 7), 'JOHN', 'Waugh', datetime.date(2016, 2, 7)),
 (1005, datetime.date(1995, 3, 25), 'Maria', 'Gracia', datetime.date(2011, 4, 9)),
 (1006, datetime.date(1994, 6, 23), 'ROBERT', 'PATRICA', datetime.date(2015, 6, 23)),
 (1008, datetime.date(1989, 4, 5), 'JAMES', 'OLIVER', datetime.date(2017, 1, 15)),
 (1004, datetime.date(1985, 6, 12), 'SOPHIA', ' TRUMP', datetime.date(2016, 2, 15)),
 (1007, datetime.date(1993, 4, 5), 'MIKE', ' JOHNSON', datetime.date(2014, 3, 9))]

##### Keeps the row with the lowest "customer_id" for each distinct "amount" and deletes the others

In [80]:
%%sql DELETE FROM payment WHERE payment_id in (SELECT max(payment_id)
                                              from payment group by customer_id having count(*) > 1)
%sql SELECT * FROM payment

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
2 rows affected.
 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
6 rows affected.

[(5, 1, 2, 1476, Decimal('9.99'), datetime.date(2005, 6, 15), datetime.datetime(2006, 2, 15, 22, 12, 30)),
 (9, 1, 1, 3284, Decimal('3.99'), datetime.date(2005, 6, 21), datetime.datetime(2006, 2, 15, 22, 12, 30)),
 (69, 3, 2, 7503, Decimal('10.99'), datetime.date(2005, 7, 27), datetime.datetime(2006, 2, 15, 22, 12, 30)),
 (70, 3, 2, 7703, Decimal('7.99'), datetime.date(2005, 7, 28), datetime.datetime(2006, 2, 15, 22, 12, 30)),
 (94, 4, 1, 8741, Decimal('3.99'), datetime.date(2005, 7, 29), datetime.datetime(2006, 2, 15, 22, 12, 30)),
 (44, 2, 2, 9236, Decimal('10.99'), datetime.date(2005, 7, 30), datetime.datetime(2006, 2, 15, 22, 12, 30))]

##### Deleting All duplicates with CTE (Common Table Expression)

In [17]:
%%sql WITH CTE AS (
  SELECT *, ROW_NUMBER() OVER (PARTITION BY amount ORDER BY payment_id) AS rn
  FROM payment)
DELETE FROM payment
WHERE payment_id IN (
  SELECT payment_id
  FROM CTE
  WHERE rn > 1
);

 * postgresql://postgres:***@localhost/my_base
38 rows affected.

[]

## Analyzing Top Traffic Sources

In [62]:
%%sql SELECT w.utm_content,
COUNT(DISTINCT w.website_session_id) AS Sessions,
COUNT(DISTINCT o.order_id) AS Orders
FROM website_sessions w
LEFT JOIN orders o ON o.website_session_id = w.website_session_id
WHERE  w.website_session_id BETWEEN 1 AND 6000 AND utm_content IS NOT NULL GROUP BY 1 ORDER BY 2 DESC

   postgresql://postgres:***@localhost/my_base
 * postgresql://postgres:***@localhost/sql_2
3 rows affected.

[('g_ad_1', 5707, 154), ('g_ad_2', 83, 6), ('b_ad_2', 15, 0)]

##  Ungroup the given input data. Display the result as per expected output

In [55]:
%%sql with recursive cte as
    (select id, item_name, total_count, 1 as level
    from travel_items
    union all
    select cte.id, cte.item_name, cte.total_count - 1, level+1 as level
    from cte
    join travel_items t on t.item_name = cte.item_name and t.id = cte.id
    where cte.total_count > 1
    )
select id, item_name
from cte
order by 1;

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
7 rows affected.

[(1, 'Water Bottle'),
 (1, 'Water Bottle'),
 (2, 'Tent'),
 (3, 'Apple'),
 (3, 'Apple'),
 (3, 'Apple'),
 (3, 'Apple')]

## Select employees who are not present in department table

In [18]:
%sql SELECT * FROM employees where department_id not in (select dep_id from departments)

 * postgresql://postgres:***@localhost/my_base
1 rows affected.

[(5, 'David', 102, Decimal('5800.00'), 1)]

##### Another syntax

In [138]:
%sql SELECT e.* FROM employees e LEFT JOIN departments d ON e.department_id = d.dep_id \
WHERE d.dep_id IS NULL

 * postgresql://postgres:***@localhost/my_base
1 rows affected.

[(5, 'David', 102, Decimal('5800.00'), 2)]

## A client wants to understand where the bulk of our website sessions are coming from, through yesterday? (By UTM Source, Campaign,referring domain!) Especially we are interested in those where number of sessions is greater than 20000

In [48]:
%%sql SELECT utm_source, utm_campaign, http_referer,
COUNT(DISTINCT  w.website_session_id) AS Numb_of_Sessions FROM website_sessions w
WHERE http_referer IS NOT NULL
GROUP BY utm_source, utm_campaign, http_referer
HAVING COUNT(DISTINCT w.website_session_id) > 20000
ORDER BY 4 DESC

   postgresql://postgres:***@localhost/my_base
 * postgresql://postgres:***@localhost/sql_2
4 rows affected.

[('gsearch', 'nonbrand', 'https://www.gsearch.com', 282706),
 ('bsearch', 'nonbrand', 'https://www.bsearch.com', 54909),
 (None, None, 'https://www.gsearch.com', 35202),
 ('gsearch', 'brand', 'https://www.gsearch.com', 33329)]

## Select the second highest salary from a table  (2 ways)

In [65]:
%%sql SELECT emp_id, emp_name, salary FROM employees WHERE salary =
(SELECT MAX(salary) FROM employees WHERE salary < (SELECT MAX(salary) FROM employees))

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
2 rows affected.

[(2, 'Anar', Decimal('6000.00')), (7, 'Smith', Decimal('6000.00'))]

##### Another way

In [82]:
%%sql SELECT emp_id, emp_name, salary FROM
(SELECT *, ROW_NUMBER() OVER(order by emp_id) as rn FROM employees e ) x WHERE x.rn = 2

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
1 rows affected.

[(2, 'Anar', Decimal('6000.00'))]

## Select the second highest salary in each department

In [84]:
%%sql SELECT * FROM (SELECT e.*, DENSE_RANK() OVER
(PARTITION BY department_id ORDER BY salary DESC) AS rk FROM employees e)ranked_employees
WHERE rk = 2;

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
4 rows affected.

[(3, 'Michael', 100, Decimal('5500.00'), 1, 2),
 (8, 'Johnson', 100, Decimal('5500.00'), 1, 2),
 (4, 'Susan', 103, Decimal('4500.00'), 2, 2),
 (9, 'Lee', 103, Decimal('4500.00'), 2, 2)]

In [55]:
%sql SELECT * FROM employees

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
9 rows affected.

[(2, 'Anar', 100, Decimal('6000.00'), 1),
 (3, 'Michael', 100, Decimal('5500.00'), 1),
 (4, 'Susan', 103, Decimal('4500.00'), 2),
 (5, 'David', 102, Decimal('5800.00'), 1),
 (6, 'Doe', 100, Decimal('5000.00'), None),
 (7, 'Smith', 200, Decimal('6000.00'), 1),
 (8, 'Johnson', 100, Decimal('5500.00'), 1),
 (9, 'Lee', 103, Decimal('4500.00'), 2),
 (1, 'Keli', 103, Decimal('6500.00'), 2)]

## Find the maximum and minimum values for each customer_id

In [73]:

%sql SELECT customer_id,\
    MAX(amount) AS max_sales,\
    MIN(amount) AS min_sales\
FROM payment GROUP BY customer_id;

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
4 rows affected.

[(1, Decimal('9.99'), Decimal('3.99')),
 (3, Decimal('10.99'), Decimal('1.99')),
 (2, Decimal('10.99'), Decimal('10.99')),
 (4, Decimal('3.99'), Decimal('3.99'))]

In [140]:
%%sql WITH CTE AS(
    SELECT empname, deptname, deptno, salary, 
    RANK() OVER(PARTITION BY deptno order by salary DESC) AS MAXIMUM,
    RANK() OVER(PARTITION BY deptno order by salary ASC) AS MINIMUM
    FROM Employee_2 
)
SELECT empname, deptname, deptno, salary 
FROM CTE where maximum = 1 or minimum = 1 order by deptno, salary

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
6 rows affected.

[('John', 'Accountant', 101, 20000),
 ('Mark', 'HR', 101, 30000),
 ('James', 'Analyst', 201, 22000),
 ('Donald', 'HR', 201, 40000),
 ('Martin', 'Analyst', 301, 22000),
 ('Robert', 'Analyst', 301, 56000)]

In [ ]:
%%sql WITH CTE AS(
    SELECT empname, deptname, deptno, salary, 
    MAX() OVER(PARTITION BY deptno order by salary DESC) AS MAXIMUM,
    MIN() OVER(PARTITION BY deptno order by salary ASC) AS MINIMUM
    FROM Employee_2 
)
SELECT empname, deptname, deptno, salary 
FROM CTE where maximum = 1 or minimum = 1 order by deptno, salary

In [145]:
%%sql WITH CTE_t AS 
(SELECT empname, deptname, deptno, salary, 
    MAX(salary) OVER(PARTITION BY deptno order by salary DESC) AS MAXIMUM,
    MIN(salary) OVER(PARTITION BY deptno order by salary ASC) AS MINIMUM
    FROM Employee_2 )
SELECT empname, deptname, deptno, salary FROM CTE_t where salary in (MAXIMUM, MINIMUM) order by deptno, salary

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
6 rows affected.

[('John', 'Accountant', 101, 20000),
 ('Mark', 'HR', 101, 30000),
 ('James', 'Analyst', 201, 22000),
 ('Donald', 'HR', 201, 40000),
 ('Martin', 'Analyst', 301, 22000),
 ('Robert', 'Analyst', 301, 56000)]

## Write in the SQL query to get the output as shown below.

In [148]:
%%sql WITH RECURSIVE CTE_alphabet AS (
  SELECT 'INTERVIEW' AS interview, LENGTH('INTERVIEW') AS len
  UNION ALL 
  SELECT SUBSTRING(interview, 1, len - 1), len - 1 FROM CTE_alphabet WHERE len - 1 > 0 
)
SELECT interview FROM CTE_alphabet;

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
9 rows affected.

[('INTERVIEW',),
 ('INTERVIE',),
 ('INTERVI',),
 ('INTERV',),
 ('INTER',),
 ('INTE',),
 ('INT',),
 ('IN',),
 ('I',)]

## Let's calculate the conversion rate(CVR) from sessions to order. We will need a CVR of at least 4% to make the number to work.

In [46]:
%%sql SELECT
COUNT(DISTINCT w.website_session_id) AS Sessions,
COUNT(DISTINCT o.order_id) AS Orders,
ROUND(CAST(COUNT(DISTINCT o.order_id) AS NUMERIC)/COUNT(DISTINCT w.website_session_id), 3) AS convertion_rate
FROM website_sessions w LEFT JOIN
orders o ON w.website_session_id = o.website_session_id
WHERE w.utm_source = 'gsearch' AND w.utm_campaign = 'nonbrand'

   postgresql://postgres:***@localhost/my_base
 * postgresql://postgres:***@localhost/sql_2
1 rows affected.

[(282706, 235, Decimal('0.001'))]

## Write a query to find the third-highest salary from the employees table

In [21]:
%sql SELECT salary FROM employees ORDER BY salary DESC LIMIT 1 OFFSET 2;

 * postgresql://postgres:***@localhost/my_base
1 rows affected.

[(Decimal('6000.00'),)]

## Write a query to fetch all employees who  hold the managerial position and concatenate two columns.

In [86]:
%%sql SELECT e.empfname, e.emplname, e2.empposition, CONCAT(e.empfname, ' ', e.emplname) AS First_Last_name
FROM employee e LEFT JOIN employeesalary e2
ON e.empid = e2.empid WHERE e2.empposition = 'Manager'

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
2 rows affected.

[('Sanjay', 'Mehra', 'Manager', 'Sanjay Mehra'),
 ('Rohan', 'Diwan', 'Manager', 'Rohan Diwan')]

## Extract Starting date, Week, Year and quantity of Sessions

In [34]:
%%sql SELECT
  MIN(DATE(created_at)) AS Week_Start,
  EXTRACT(WEEK FROM created_at) AS week,
  EXTRACT(YEAR FROM created_at) AS Year,
  COUNT(DISTINCT website_session_id) AS Count
FROM website_sessions
WHERE website_session_id BETWEEN 1 AND 5000
GROUP BY 2,3 ORDER BY 4 DESC

   postgresql://postgres:***@localhost/my_base
 * postgresql://postgres:***@localhost/sql_2
6 rows affected.

[(datetime.date(2012, 4, 2), Decimal('14'), Decimal('2012'), 1180),
 (datetime.date(2012, 4, 9), Decimal('15'), Decimal('2012'), 1009),
 (datetime.date(2012, 3, 26), Decimal('13'), Decimal('2012'), 1007),
 (datetime.date(2012, 3, 19), Decimal('12'), Decimal('2012'), 969),
 (datetime.date(2012, 4, 16), Decimal('16'), Decimal('2012'), 673),
 (datetime.date(2012, 4, 23), Decimal('17'), Decimal('2012'), 162)]

## Fetch odd or even numbers

In [6]:
%sql SELECT * FROM employees WHERE MOD(department_id, 2) = 0;

 * postgresql://postgres:***@localhost/my_base
6 rows affected.

[(2, 'Anar', 100, Decimal('6000.00'), 1),
 (3, 'Michael', 100, Decimal('5500.00'), 1),
 (5, 'David', 102, Decimal('5800.00'), 1),
 (6, 'Doe', 100, Decimal('5000.00'), None),
 (7, 'Smith', 200, Decimal('6000.00'), 1),
 (8, 'Johnson', 100, Decimal('5500.00'), 1)]

## Count the number of items  where items_purchased = 1 and 2.

In [15]:
%%sql SELECT primary_product_id,
COUNT(DISTINCT CASE WHEN items_purchased = 1 THEN order_id ELSE NULL END) AS Count_single_item_orders,
COUNT(DISTINCT CASE WHEN items_purchased = 2 THEN order_id ELSE NULL END) AS Count_two_item_orders
FROM orders GROUP BY 1

   postgresql://postgres:***@localhost/my_base
 * postgresql://postgres:***@localhost/sql_2
1 rows affected.

[(1, 264, 0)]

In [40]:
%%sql SELECT * FROM
employees

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
9 rows affected.

[(2, 'Anar', 100, Decimal('6000.00'), 1),
 (3, 'Michael', 100, Decimal('5500.00'), 1),
 (4, 'Susan', 103, Decimal('4500.00'), 2),
 (5, 'David', 102, Decimal('5800.00'), 1),
 (6, 'Doe', 100, Decimal('5000.00'), None),
 (7, 'Smith', 200, Decimal('6000.00'), 1),
 (8, 'Johnson', 100, Decimal('5500.00'), 1),
 (9, 'Lee', 103, Decimal('4500.00'), 2),
 (1, 'Keli', 103, Decimal('6500.00'), 2)]

##### Another syntax

In [42]:
#%sql SELECT * FROM employees WHERE CASE WHEN department_id % 2 =1 THEN 1 ELSE 0 END = 1 ;
%sql SELECT emp_id, emp_name, department_id FROM\
(\
    SELECT emp_id, emp_name, department_id, ROW_NUMBER() OVER (ORDER BY emp_id) as rows_eo\
    FROM employees\
) subquery\
WHERE MOD(rows_eo, 2) = 0;

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
4 rows affected.

[(2, 'Anar', 100), (4, 'Susan', 103), (6, 'Doe', 100), (8, 'Johnson', 100)]

## Let's pull gsearch nonbrand trended session volume by week, to see if the bid changes have caused volume to drop?

In [90]:
%%sql SELECT
EXTRACT (YEAR FROM created_at) AS Year,
EXTRACT (WEEK FROM created_at) AS WEEK,
MIN(DATE(created_at)) AS Week_Start,
COUNT(DISTINCT website_session_id) AS Session FROM website_sessions WHERE utm_source = 'gsearch'
AND utm_campaign = 'nonbrand' GROUP BY 1,2 ORDER BY 3 DESC LIMIT 10

   postgresql://postgres:***@localhost/my_base
 * postgresql://postgres:***@localhost/sql_2
10 rows affected.

[(Decimal('2015'), Decimal('12'), datetime.date(2015, 3, 16), 1749),
 (Decimal('2015'), Decimal('11'), datetime.date(2015, 3, 9), 3202),
 (Decimal('2015'), Decimal('10'), datetime.date(2015, 3, 2), 3158),
 (Decimal('2015'), Decimal('9'), datetime.date(2015, 2, 23), 3122),
 (Decimal('2015'), Decimal('8'), datetime.date(2015, 2, 16), 3073),
 (Decimal('2015'), Decimal('7'), datetime.date(2015, 2, 9), 3796),
 (Decimal('2015'), Decimal('6'), datetime.date(2015, 2, 2), 3107),
 (Decimal('2015'), Decimal('5'), datetime.date(2015, 1, 26), 3167),
 (Decimal('2015'), Decimal('4'), datetime.date(2015, 1, 19), 3057),
 (Decimal('2015'), Decimal('3'), datetime.date(2015, 1, 12), 3091)]

## Make the list of emails anonimous

In [67]:
%%sql SELECT  email, CONCAT(SUBSTRING(email FROM POSITION(first_name IN email) FOR 1), '***.',
                           SUBSTRING(email FROM POSITION(last_name IN email) FOR 1),
                           '***',
                           RIGHT(email, 19)) AS Extracted FROM customer LIMIT 3

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
3 rows affected.

[('MARY.SMITH@sakilacustomer.org', 'M***.S***@sakilacustomer.org'),
 ('PATRICIA.JOHNSON@sakilacustomer.org', 'P***.J***@sakilacustomer.org'),
 ('LINDA.WILLIAMS@sakilacustomer.org', 'L***.W***@sakilacustomer.org')]

## Write a query to retrieve three minimum and maximum salaries from the EmployeePosition table.

In [96]:
%%sql SELECT DISTINCT salary FROM employeesalary e WHERE 3 >= (SELECT COUNT(DISTINCT salary)
FROM employeesalary e2 WHERE e.salary <= e2.salary) ORDER BY salary DESC;

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
3 rows affected.

[(500000,), (300000,), (90000,)]

In [97]:
%%sql SELECT DISTINCT salary FROM employeesalary e WHERE 3 <= (SELECT COUNT(DISTINCT salary)
FROM employeesalary e2 WHERE e.salary <= e2.salary) ORDER BY salary DESC;

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
3 rows affected.

[(90000,), (85000,), (75000,)]

## Write a query to retrieve the list of employees working in the same department.

In [11]:
%sql Select DISTINCT e.empid, e.empfname, e.department\
FROM employee e, employee e1\
WHERE e.department = e1.department AND e.empid <> e1.empid;

 * postgresql://postgres:***@localhost/my_base
4 rows affected.

[(5, 'Ankit', 'Admin'),
 (4, 'Sonia', 'HR'),
 (1, 'Sanjay', 'HR'),
 (2, 'Ananya', 'Admin')]

## Write a query to retrieve the list of employees working in the same department.

In [19]:
%sql SELECT DISTINCT e.empid, e.empfname, e.department\
FROM employee e, employee e2\
WHERE e.department = e2.department AND e.empid != e2.empid;

 * postgresql://postgres:***@localhost/my_base
4 rows affected.

[(5, 'Ankit', 'Admin'),
 (4, 'Sonia', 'HR'),
 (1, 'Sanjay', 'HR'),
 (2, 'Ananya', 'Admin')]

## Find employees with the highest salary in a department?

In [125]:
%%sql SELECT e.emp_name, e.department_id, e1.Sal_max FROM employees e
INNER JOIN
(SELECT department_id, MAX(salary) AS Sal_max FROM employees GROUP BY department_id) AS e1
ON e.department_id = e1.department_id AND e.salary = e1.Sal_max

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
4 rows affected.

[('Anar', 100, Decimal('6000.00')),
 ('David', 102, Decimal('5800.00')),
 ('Smith', 200, Decimal('6000.00')),
 ('Keli', 103, Decimal('6500.00'))]

## Write a SQL to find top 2 records from each department

In [127]:
%%sql 
WITH CTE_Rank as 
(SELECT emp_name, department_id, salary, 
ROW_NUMBER() OVER(PARTITION BY department_id order by salary) as ranking  FROM employees) 
SELECT * FROM CTE_Rank WHERE ranking <=2 ORDER BY ranking asc

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
6 rows affected.

[('Doe', 100, Decimal('5000.00'), 1),
 ('David', 102, Decimal('5800.00'), 1),
 ('Susan', 103, Decimal('4500.00'), 1),
 ('Smith', 200, Decimal('6000.00'), 1),
 ('Michael', 100, Decimal('5500.00'), 2),
 ('Lee', 103, Decimal('4500.00'), 2)]

## Write a query to display if the first and a alst call number is the same then yes otherwise No.

In [128]:
%%sql SELECT source_phone_nbr, 
CASE WHEN first_r = last_r THEN 'Yes'
    WHEN first_r <> last_r THEN 'No' END AS Final_output FROM 
 (SELECT source_phone_nbr, 
    MAX(CASE  WHEN first_rank = 1 THEN destination_phone_nbr end) AS first_r,
    MAX(CASE  WHEN last_rank = 1  THEN destination_phone_nbr end)   AS last_r
         FROM 
    (SELECT source_phone_nbr, destination_phone_nbr, call_start_datetime,
    ROW_NUMBER() OVER(PARTITION BY source_phone_nbr order by call_start_datetime) as first_rank,
    ROW_NUMBER() OVER(PARTITION BY source_phone_nbr order by call_start_datetime desc) as last_rank
    FROM phone_log ) as A  group by source_phone_nbr)B

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
2 rows affected.

[(2345, 'Yes'), (3311, 'No')]

## Analize the channel portfolio

In [23]:
%sql SELECT utm_content,\
    COUNT(DISTINCT w.website_session_id) AS SESSIONS,\
    COUNT(DISTINCT o.order_id) AS ORDERS,\
    ROUND(CAST(COUNT(DISTINCT o.order_id) AS NUMERIC)/COUNT(DISTINCT w.website_session_id), 3) AS convertion_rate\
FROM website_sessions w\
    LEFT JOIN orders o ON w.website_session_id = o.website_session_id\
    WHERE w.created_at BETWEEN '2012-03-19' AND '2012-04-05'\
    GROUP BY 1 ORDER BY 2 DESC

   postgresql://postgres:***@localhost/my_base
 * postgresql://postgres:***@localhost/sql_2
4 rows affected.

[('g_ad_1', 2735, 80, Decimal('0.029')),
 (None, 39, 1, Decimal('0.026')),
 ('g_ad_2', 17, 1, Decimal('0.059')),
 ('b_ad_2', 4, 0, Decimal('0.000'))]

## Find the distance travelled by bus per day

##### Here is cumulative data

In [14]:
%sql SELECT *  FROM bus_data

 * postgresql://postgres:***@localhost/my_base
7 rows affected.

[('Bus A', 'Monday', 30),
 ('Bus A', 'Tuesday', 70),
 ('Bus A', 'Wednesday', 150),
 ('Bus B', 'Wednesday', 0),
 ('Bus C', 'Monday', 0),
 ('Bus C', 'Tuesday', 130),
 ('Bus C', 'Wednesday', 200)]

In [69]:
%%sql SELECT bus, days,
(distance - lag(distance, 1, 0) OVER(PARTITION BY bus order by distance))
as distance  FROM bus_data

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
7 rows affected.

[('Bus A', 'Monday', 30),
 ('Bus A', 'Tuesday', 40),
 ('Bus A', 'Wednesday', 80),
 ('Bus B', 'Wednesday', 0),
 ('Bus C', 'Monday', 0),
 ('Bus C', 'Tuesday', 130),
 ('Bus C', 'Wednesday', 70)]

## Pick up the employees with the same salary

In [71]:
%%sql SELECT e.emp_name, e.salary FROM employees e
INNER JOIN
employees e1
ON e.salary = e1.salary
AND e.emp_id != e1.emp_id ORDER BY 2 DESC

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
6 rows affected.

[('Anar', Decimal('6000.00')),
 ('Smith', Decimal('6000.00')),
 ('Michael', Decimal('5500.00')),
 ('Johnson', Decimal('5500.00')),
 ('Lee', Decimal('4500.00')),
 ('Susan', Decimal('4500.00'))]

## Write a query to fetch the record of brand whose amount is increasing every year

In [75]:
%%sql WITH CTE AS 
(SELECT *,
lead(price) over (PARTITION BY brand ORDER BY year),
(case WHEN price < lead(price, 1, price + 1) over (PARTITION BY brand ORDER BY year)THEN 1 else 0 end) AS Trend
FROM year_brand_price)
SELECT * from year_brand_price WHERE brand not in (SELECT brand FROM CTE WHERE Trend = 0)

   postgresql://postgres:***@localhost/my_base
 * postgresql://postgres:***@localhost/sql_2
3 rows affected.

[(1, 2020, 'Brand A', Decimal('1000.50')),
 (2, 2021, 'Brand A', Decimal('1500.25')),
 (3, 2022, 'Brand A', Decimal('2990.75'))]

In [ ]:
## Analyzing Direct, Brand-Driven Traffic

## Write a query to return the account number and the transaction date when the account balance reached 1000. Include only those accounts whose balance  currently is >=1000. (3 dif. ways)

In [77]:
%%sql  WITH CTE AS
(SELECT account_number, transaction_date, case when debit_credit = 'Debit' then transaction_amount * -1 else
transaction_amount * 1 end as conv_column FROM transactions),
final_data AS(SELECT *,
                sum(conv_column) OVER(PARTITION BY account_number order by transaction_date)  AS Current_balance,
                sum(conv_column) OVER(PARTITION BY account_number order by transaction_date
                                 range between unbounded preceding and unbounded following) as balance
                  FROM CTE)
SELECT * FROM final_data where balance > 1000;

   postgresql://postgres:***@localhost/my_base
 * postgresql://postgres:***@localhost/sql_2
4 rows affected.

[('A1', datetime.date(2023, 8, 1), Decimal('1000.00'), Decimal('1000.00'), Decimal('1700.00')),
 ('A1', datetime.date(2023, 8, 2), Decimal('1000.00'), Decimal('2000.00'), Decimal('1700.00')),
 ('A1', datetime.date(2023, 8, 3), Decimal('-500.00'), Decimal('1500.00'), Decimal('1700.00')),
 ('A1', datetime.date(2023, 8, 4), Decimal('200.00'), Decimal('1700.00'), Decimal('1700.00'))]

In [113]:
%%sql 
SELECT account_number, debit_credit,transaction_amount,
SUM(tr_amount) OVER(PARTITION BY account_number order by transaction_date) as tr_amount FROM 
    (SELECT account_number, transaction_date, debit_credit, transaction_amount, 
    CASE 
    WHEN debit_credit = 'Credit' THEN transaction_amount
    WHEN debit_credit = 'Debit' THEN transaction_amount * -1 END AS tr_amount 
FROM transactions) aa

   postgresql://postgres:***@localhost/my_base
 * postgresql://postgres:***@localhost/sql_2
10 rows affected.

[('A1', 'Credit', Decimal('1000.00'), Decimal('1000.00')),
 ('A1', 'Credit', Decimal('1000.00'), Decimal('2000.00')),
 ('A1', 'Debit', Decimal('500.00'), Decimal('1500.00')),
 ('A1', 'Credit', Decimal('200.00'), Decimal('1700.00')),
 ('B2', 'Credit', Decimal('500.00'), Decimal('500.00')),
 ('B2', 'Credit', Decimal('1100.00'), Decimal('1600.00')),
 ('B2', 'Debit', Decimal('1000.00'), Decimal('600.00')),
 ('C1', 'Credit', Decimal('500.00'), Decimal('500.00')),
 ('C2', 'Credit', Decimal('1500.00'), Decimal('1500.00')),
 ('C2', 'Debit', Decimal('500.00'), Decimal('1000.00'))]

In [114]:
%%sql WITH CTE_transaction_amount  AS 
(SELECT account_number, transaction_date, debit_credit, transaction_amount, 
 CASE 
     WHEN debit_credit = 'Credit' THEN transaction_amount
     WHEN debit_credit = 'Debit' THEN transaction_amount * -1 END AS tr_amount 
     FROM transactions)
SELECT account_number, debit_credit,transaction_amount,
SUM(tr_amount) OVER(PARTITION BY account_number order by transaction_date) as tr_amount FROM 
CTE_transaction_amount

   postgresql://postgres:***@localhost/my_base
 * postgresql://postgres:***@localhost/sql_2
10 rows affected.

[('A1', 'Credit', Decimal('1000.00'), Decimal('1000.00')),
 ('A1', 'Credit', Decimal('1000.00'), Decimal('2000.00')),
 ('A1', 'Debit', Decimal('500.00'), Decimal('1500.00')),
 ('A1', 'Credit', Decimal('200.00'), Decimal('1700.00')),
 ('B2', 'Credit', Decimal('500.00'), Decimal('500.00')),
 ('B2', 'Credit', Decimal('1100.00'), Decimal('1600.00')),
 ('B2', 'Debit', Decimal('1000.00'), Decimal('600.00')),
 ('C1', 'Credit', Decimal('500.00'), Decimal('500.00')),
 ('C2', 'Credit', Decimal('1500.00'), Decimal('1500.00')),
 ('C2', 'Debit', Decimal('500.00'), Decimal('1000.00'))]

## Fetch consecutive records when temperature is less than 0  (2 ways)

In [19]:
%sql WITH table_1 as\
        (SELECT *,\
        ROW_NUMBER() OVER(order by id),\
        id - ROW_NUMBER() OVER(order by id) as difference_column\
        FROM weather WHERE temperature < 0),\
        table_2 as\
        (SELECT id,city, temperature, COUNT(*) OVER (partition by difference_column ) AS records_number FROM table_1)\
SELECT * FROM table_2 WHERE records_number = 5

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
5 rows affected.

[(12, 'London', -1, 5),
 (13, 'London', -2, 5),
 (14, 'London', -2, 5),
 (15, 'London', -4, 5),
 (16, 'London', -9, 5)]

##### The way of printing them out without id.

In [116]:
%%sql 
WITH table_0 as
        (SELECT *, ROW_NUMBER() OVER() AS id FROM virt_weather),
        table_1 as
            (SELECT *, ROW_NUMBER() OVER(),
            id - ROW_NUMBER() OVER(order by id) as difference_column
            FROM table_0 WHERE temperature < 0),
        table_2 as
            (SELECT id,city, temperature, COUNT(*) OVER (partition by difference_column ) AS records_number FROM table_1)
    SELECT * FROM table_2 WHERE records_number = 5

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
5 rows affected.

[(12, 'London', -1, 5),
 (13, 'London', -2, 5),
 (14, 'London', -2, 5),
 (15, 'London', -4, 5),
 (16, 'London', -9, 5)]

In [108]:
%%sql SELECT department_id,
    MIN(salary) AS min_salary,
    MAX(salary) AS max_salary
FROM employees GROUP BY department_id ORDER BY department_id;

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
4 rows affected.

[(100, Decimal('5000.00'), Decimal('6000.00')),
 (102, Decimal('5800.00'), Decimal('5800.00')),
 (103, Decimal('4500.00'), Decimal('6500.00')),
 (200, Decimal('6000.00'), Decimal('6000.00'))]

## Write in the SQL query whose total marks are greater or equal to the previous year

In [107]:
%%sql SELECT student_name, total_marks, year, previous_masks FROM (
SELECT student_name, total_marks, year, previous_masks,
CASE WHEN total_marks >= previous_masks THEN 1 ELSE 0 END AS Flag FROM
(SELECT student_name, total_marks, year,
LAG(total_marks) OVER(PARTITION BY student_name order by year) AS previous_masks
FROM student) aa) B where Flag = 1

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
3 rows affected.

[('Mohan', 90, 2012, 65), ('Rahul', 90, 2011, 90), ('Sanjay', 85, 2011, 80)]

## Write a query to derive another column, to concatenate email columns  based on  depid.

In [62]:
%sql SELECT deptid, STRING_AGG(emailid, '; ') AS Email_list FROM emp_details GROUP BY deptid;

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
5 rows affected.

[(101, 'CCCC@yahu.com'),
 (103, 'ZZZ@gmaix.com'),
 (104, 'YYYYY@gmaix.com; PP@gmaix.com'),
 (102, 'AAAAA@gmaix.com; E@yahu.com; M@yahu.com'),
 (100, 'DDDDD@yahu.com; SS@yahu.com')]

## Get the highest sold, sales on specific days, and products ordered more than once.

In [106]:
%%sql select o1.order_day, o2.product_id, o1.Max_sold_amount FROM
((select order_day,  max(price * quantity) as Max_sold_amount from order_tbl  group by order_day) o1
INNER JOIN (select order_day, product_id,  price * quantity  as Max_sold_amount FROM order_tbl) o2
ON o1.order_day = o2.order_day AND o1.Max_sold_amount = o2.Max_sold_amount)

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
2 rows affected.

[(datetime.date(2015, 5, 1), 'PROD3', 250),
 (datetime.date(2015, 5, 2), 'PROD3', 125)]

## Write a SQL query to get all product's total sell on 1st and 2nd May adjacent to each other.

In [105]:
%%sql SELECT product_id,
    COALESCE(SUM(sales1), 0) AS tot_sales_1,
    COALESCE(SUM(sales2), 0) AS tot_sales_2
FROM(
SELECT product_id,
CASE WHEN order_day = '2015-05-01' THEN Tot_sales END as "sales1",
CASE WHEN order_day = '2015-05-02' THEN Tot_sales END as "sales2" FROM (
SELECT order_day, product_id, sum(quantity * price) AS Tot_sales FROM order_tbl group by order_day, product_id)
AS A) B GROUP BY product_id ORDER BY 3 DESC;

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
6 rows affected.

[('PROD3', Decimal('250'), Decimal('125')),
 ('PROD4', Decimal('0'), Decimal('120')),
 ('PROD6', Decimal('0'), Decimal('100')),
 ('PROD5', Decimal('0'), Decimal('50')),
 ('PROD2', Decimal('20'), Decimal('40')),
 ('PROD1', Decimal('125'), Decimal('10'))]

## Find employees who earn more or equal  the average salary in their department. (2 ways)

##### Join

In [103]:
%%sql SELECT emp_name, e1.department_id, salary, AVG_SAL FROM employees e1 INNER JOIN
(SELECT department_id, round(avg(salary),2) as AVG_SAL FROM employees GROUP BY department_id) e2 ON
e1.department_id = e2.department_id AND e1.salary >= e2.AVG_SAL

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
6 rows affected.

[('Anar', 100, Decimal('6000.00'), Decimal('5500.00')),
 ('Michael', 100, Decimal('5500.00'), Decimal('5500.00')),
 ('David', 102, Decimal('5800.00'), Decimal('5800.00')),
 ('Smith', 200, Decimal('6000.00'), Decimal('6000.00')),
 ('Johnson', 100, Decimal('5500.00'), Decimal('5500.00')),
 ('Keli', 103, Decimal('6500.00'), Decimal('5166.67'))]

##### CTE

In [101]:
%%sql WITH CTE_employee as (
SELECT emp_id, emp_name, department_id, salary FROM employees),
CTE_average as  (
SELECT department_id, round(AVG(salary),3) as average FROM employees GROUP BY department_id)
SELECT t1.department_id, t1.emp_name, t1.salary, t2.average FROM CTE_employee t1
INNER JOIN CTE_average t2 ON
t1.department_id = t2.department_id WHERE t1.salary >= t2.average

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
6 rows affected.

[(100, 'Anar', Decimal('6000.00'), Decimal('5500.000')),
 (100, 'Michael', Decimal('5500.00'), Decimal('5500.000')),
 (102, 'David', Decimal('5800.00'), Decimal('5800.000')),
 (200, 'Smith', Decimal('6000.00'), Decimal('6000.000')),
 (100, 'Johnson', Decimal('5500.00'), Decimal('5500.000')),
 (103, 'Keli', Decimal('6500.00'), Decimal('5166.667'))]

##### Subquery

In [99]:
%%sql SELECT e.emp_name, e.department_id, e.salary
FROM employees e WHERE salary >= (
SELECT AVG(salary) AS AVG_sal FROM employees e2 WHERE
e.department_id = e2.department_id)

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
6 rows affected.

[('Anar', 100, Decimal('6000.00')),
 ('Michael', 100, Decimal('5500.00')),
 ('David', 102, Decimal('5800.00')),
 ('Smith', 200, Decimal('6000.00')),
 ('Johnson', 100, Decimal('5500.00')),
 ('Keli', 103, Decimal('6500.00'))]

## Write in all the possible combinations of matches that can happen between each team

In [118]:
%%sql SELECT CONCAT(e1.department, ' vs ', e2.department) AS Matches FROM(
(SELECT empid, department FROM employee) e1
INNER JOIN
(SELECT empid, department FROM employee) e2
ON e1.empid < e2.empid)

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
10 rows affected.

[('HR vs Admin',),
 ('HR vs Account',),
 ('HR vs HR',),
 ('HR vs Admin',),
 ('Admin vs Account',),
 ('Admin vs HR',),
 ('Admin vs Admin',),
 ('Account vs HR',),
 ('Account vs Admin',),
 ('HR vs Admin',)]

## Find number of matches played and total number of match won and lost by each team

In [120]:
%%sql WITH CTE_played as
(SELECT team_1, SUM(total) as Match_Played FROM
(SELECT team_1, COUNT(*) AS Total FROM match_result group by team_1
UNION ALL
SELECT team_2, COUNT(*) AS Total FROM match_result group by team_2) t1 GROUP BY team_1),
CTE_won_match as(
SELECT result, COUNT(*) AS match_won FROM match_result where result is not null  group by result)
SELECT AA.team_1, AA.Match_Played, B.match_won, (AA.Match_Played - B.match_won) AS Match_Lost
FROM CTE_played  AA inner join CTE_won_match AS B ON AA.team_1 = B.result

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
4 rows affected.

[('Australia', Decimal('3'), 1, Decimal('2')),
 ('England', Decimal('3'), 1, Decimal('2')),
 ('India', Decimal('4'), 2, Decimal('2')),
 ('SouthAfrica', Decimal('2'), 1, Decimal('1'))]

## Write SQL to get the most recent / latest balance and transaction id for each accountnumber. (Two ways)

In [122]:
%%sql SELECT A.accountnumber, A.transactiontime, A.transactionid, A.balance FROM transaction_table A
INNER JOIN
(SELECT accountnumber, MIN(transactiontime) AS transactiontime FROM transaction_table group by
accountnumber ) B
ON A.transactiontime = B.transactiontime

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
3 rows affected.

[(550, datetime.datetime(2020, 5, 12, 5, 29, 44, 120000), 1001, 2000),
 (460, datetime.datetime(2020, 3, 15, 11, 29, 23, 620000), 1003, 9000),
 (640, datetime.datetime(2020, 2, 18, 6, 29, 34, 420000), 1006, 5000)]

In [101]:
%%sql With CTE_Train as(
SELECT accountnumber, transactiontime, transactionid, balance FROM transaction_table
),
CTE_MaxTrain as (
SELECT accountnumber, MAX(transactiontime) AS MaxTran FROM transaction_table group by
accountnumber)
SELECT A.accountnumber, B.MaxTran AS Transactiontime, A.transactionid, A.balance FROM
CTE_Train A INNER JOIN CTE_MaxTrain B on A.transactiontime = B.MaxTran

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
3 rows affected.

[(550, datetime.datetime(2020, 5, 15, 10, 29, 25, 630000), 1002, 8000),
 (460, datetime.datetime(2020, 4, 30, 12, 32, 44, 233000), 1005, 5000),
 (640, datetime.datetime(2020, 2, 18, 6, 29, 37, 120000), 1007, 9000)]

## Write SQL to get the total sales in year 1998, 1999, 2000 get them as columns

In [105]:
%%sql
SELECT 
  'TotalSales' as TotalSales, 
  SUM(CASE WHEN salesyear = '1998' THEN quantitysold ELSE 0 END) as "1998", 
  SUM(CASE WHEN salesyear = '1999' THEN quantitysold ELSE 0 END) as "1999", 
  SUM(CASE WHEN salesyear = '2000' THEN quantitysold ELSE 0 END) as "2000"
FROM
  (SELECT
    salesyear,
    SUM(quantitysold) as quantitysold
  FROM salestable
  GROUP BY salesyear) t;

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
1 rows affected.

[('TotalSales', Decimal('10800'), Decimal('11800'), Decimal('13800'))]

## Get the running total or cumulative sum of quantity for each product based on the year

In [117]:
%%sql SELECT
    product,
    salesyear,
    SUM(quantitysold) OVER (PARTITION BY product ORDER BY salesyear) AS SUMM
  FROM salestable

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
9 rows affected.

[('Keyboard', 1998, 2300),
 ('Keyboard', 1999, 7100),
 ('Keyboard', 2000, 12100),
 ('Laptop', 1998, 2500),
 ('Laptop', 1999, 6100),
 ('Laptop', 2000, 10300),
 ('Mouse', 1998, 6000),
 ('Mouse', 1999, 9400),
 ('Mouse', 2000, 14000)]

## Get the minimum and sum of each product

In [137]:
%%sql SELECT salesyear, product,
MIN(quantitysold) OVER(PARTITION BY product order by salesyear) as Min,
SUM(quantitysold) OVER(PARTITION BY product order by salesyear) as Sum
FROM salestable

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
9 rows affected.

[(1998, 'Keyboard', 2300, 2300),
 (1999, 'Keyboard', 2300, 7100),
 (2000, 'Keyboard', 2300, 12100),
 (1998, 'Laptop', 2500, 2500),
 (1999, 'Laptop', 2500, 6100),
 (2000, 'Laptop', 2500, 10300),
 (1998, 'Mouse', 6000, 6000),
 (1999, 'Mouse', 3400, 9400),
 (2000, 'Mouse', 3400, 14000)]

In [138]:
%%sql SELECT salesyear, product,
MIN(quantitysold) OVER(PARTITION BY product order by salesyear) as Min,
SUM(quantitysold) OVER(PARTITION BY product order by salesyear) as Sum
FROM salestable

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
9 rows affected.

[(1998, 'Keyboard', 2300, 2300),
 (1999, 'Keyboard', 2300, 7100),
 (2000, 'Keyboard', 2300, 12100),
 (1998, 'Laptop', 2500, 2500),
 (1999, 'Laptop', 2500, 6100),
 (2000, 'Laptop', 2500, 10300),
 (1998, 'Mouse', 6000, 6000),
 (1999, 'Mouse', 3400, 9400),
 (2000, 'Mouse', 3400, 14000)]

In [ ]:
## https://www.youtube.com/watch?v=QmmCkBIFRo4&list=PLt_np4tyN7RO9XgsyKhr5YOXK8LA7X85-&index=31

## Write in sql TO DERIVE start and end dates when there is a continuous amount

In [120]:
%%sql 
WITH BALANCE_CTE AS(
    SELECT balance, dates, 
    CASE WHEN lag(balance) OVER(order by dates) = balance then 0 ELSE 1 end AS temp_seq
    FROM balancetbl
), 
SEQUENCE_CTE AS (
    SELECT balance, dates, 
    SUM(temp_seq) OVER(ORDER BY dates) AS seq FROM BALANCE_CTE

)

SELECT balance, 
MIN(dates) as Start_Dates,
MAX(dates) as End_Dates,
seq FROM SEQUENCE_CTE
GROUP BY seq, balance order by seq desc

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
5 rows affected.

[(31000, datetime.date(2020, 1, 9), datetime.date(2020, 1, 9), 5),
 (32000, datetime.date(2020, 1, 8), datetime.date(2020, 1, 8), 4),
 (26000, datetime.date(2020, 1, 6), datetime.date(2020, 1, 7), 3),
 (30000, datetime.date(2020, 1, 4), datetime.date(2020, 1, 5), 2),
 (26000, datetime.date(2020, 1, 1), datetime.date(2020, 1, 3), 1)]

## Write SQL query to get total sales amount in USD for each sales date

In [136]:
%%sql SELECT sales_date, SUM(sales_amount * B.exchange_rate) AS TOT_USD
FROM (
    SELECT A.*, B.exchange_rate, B.effective_end_date
    FROM sales_table A
    INNER JOIN (
        SELECT source_currency,
               exchange_rate,
               effective_start_date,
               COALESCE(LEAD(effective_start_date, 1, '9999-12-31') OVER (PARTITION BY source_currency ORDER BY effective_start_date), '9999-12-31') AS effective_end_date
        FROM ExchangeRate_Table
    ) B ON A.currency = B.source_currency AND A.sales_date BETWEEN B.effective_start_date - INTERVAL '1 day' AND B.effective_end_date
) AS B
GROUP BY sales_date order by 2 desc;

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
4 rows affected.

[(datetime.date(2020, 1, 2), 679.0),
 (datetime.date(2020, 1, 1), 276.5),
 (datetime.date(2020, 1, 17), 270.0),
 (datetime.date(2020, 1, 3), 7.5)]

## Get unique combination of two columns irrespective of their order

In [124]:
%%sql select distinct
case when start_location > end_location  then end_location else start_location end as source,
case when start_location > end_location  then start_location else end_location end as dest,
distance
from Travel_Table

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
4 rows affected.

[('Ahmedabad', 'Mumbai', 500),
 ('Patna', 'Ranchi', 300),
 ('Delhi', 'Pune', 1400),
 ('Bangalore', 'Chennai', 350)]

In [130]:
%%sql WITH MinMax AS (
    SELECT MIN(Start_Range) AS MinStart, MAX(End_Range) AS MaxEnd FROM SampleTable
)
SELECT generate_series(MinStart, MaxEnd) AS id FROM MinMax;

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
15 rows affected.

[(1,),
 (2,),
 (3,),
 (4,),
 (5,),
 (6,),
 (7,),
 (8,),
 (9,),
 (10,),
 (11,),
 (12,),
 (13,),
 (14,),
 (15,)]

In [131]:
%%sql WITH CTE_A AS (
SELECT x,y,z, COUNT(*) OVER(PARTITION BY x, y order by x) as Cnt FROM sample_1
)
SELECT x,y,z,cnt FROM CTE_A  WHERE Cnt > 1

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
5 rows affected.

[(200, 400, 2, 3),
 (200, 400, 3, 3),
 (200, 400, 1, 3),
 (500, 600, 2, 2),
 (500, 600, 1, 2)]

## Self Join Manager for Employee

In [132]:
%%sql SELECT Emp.EmployeeName, COALESCE(Mng.EmployeeName, 'Boss') AS Manager
FROM Employee_1 AS Emp
LEFT JOIN Employee_1 Mng ON Emp.ManagerID = Mng.EmployeeID;

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
5 rows affected.

[('Mark', 'Tom'),
 ('John', 'David'),
 ('Maria', 'Tom'),
 ('Tom', 'Boss'),
 ('David', 'Tom')]

## Create some conditions of the othe output table

In [149]:
%%sql WITH CTE_order as (
    SELECT distinct quote_id, order_status FROM orderstatus
    ),
    CTE_lists as(
    SELECT quote_id, STRING_AGG(order_status, '; ') FROM CTE_order group by 
    quote_id 
    )
SELECT * FROM CTE_lists

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
4 rows affected.

[('B', 'Delivered; Submitted; Created'),
 ('C', 'Submitted; Created'),
 ('D', 'Created'),
 ('A', 'Delivered')]

In [152]:
%%sql WITH CTE_order AS (
    SELECT DISTINCT quote_id, order_status FROM orderstatus
),
CTE_lists AS (
    SELECT quote_id, STRING_AGG(order_status, '; ') AS list_status FROM CTE_order GROUP BY quote_id
)
 
SELECT quote_id, 
       CASE 
            WHEN POSITION('Delivered' IN list_status) = 1 AND POSITION('; ' IN list_status) = 0 THEN 'Complete' WHEN POSITION('Delivered' IN list_status) = 1 AND POSITION('; ' IN list_status) > 0 THEN 'In delivery' 
            WHEN POSITION('Submitted' IN list_status) = 1 AND POSITION('; ' IN list_status) > 0 THEN 'Awaiting' 
            ELSE NULL END AS quote_status
FROM CTE_lists;

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
4 rows affected.

[('B', 'In delivery'), ('C', 'Awaiting'), ('D', None), ('A', 'Complete')]

## Find in the query where first name is not in upper case

In [168]:
%%sql SELECT * FROM employee_3
WHERE first_name != UPPER(first_name);

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
2 rows affected.

[(1002, datetime.date(1990, 5, 10), 'Mark', 'Jennifer', datetime.date(2010, 6, 25)),
 (1005, datetime.date(1995, 3, 25), 'Maria', 'Gracia', datetime.date(2011, 4, 9))]

## Combine firstnames and lastnames in one column

In [175]:
%%sql SELECT * FROM 
employee_3

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
8 rows affected.

[(1001, datetime.date(1988, 8, 15), 'ADAM', 'WAUGH', datetime.date(2013, 4, 12)),
 (1002, datetime.date(1990, 5, 10), 'Mark', 'Jennifer', datetime.date(2010, 6, 25)),
 (1003, datetime.date(1992, 2, 7), 'JOHN', 'Waugh', datetime.date(2016, 2, 7)),
 (1004, datetime.date(1985, 6, 12), 'SOPHIA TRUMP', '', datetime.date(2016, 2, 15)),
 (1005, datetime.date(1995, 3, 25), 'Maria', 'Gracia', datetime.date(2011, 4, 9)),
 (1006, datetime.date(1994, 6, 23), 'ROBERT', 'PATRICA', datetime.date(2015, 6, 23)),
 (1007, datetime.date(1993, 4, 5), 'MIKE JOHNSON', '', datetime.date(2014, 3, 9)),
 (1008, datetime.date(1989, 4, 5), 'JAMES', 'OLIVER', datetime.date(2017, 1, 15))]

## Check out the date difference between the column dates and 15 of june in 2019

In [9]:
%%sql WITH CTE_difference AS (
  SELECT
    employee_no,
    CAST(DATE_PART('year', AGE('2019-06-15'::DATE, joining_date)) * 12 +
    DATE_PART('month', AGE('2019-06-15'::DATE, joining_date)) AS FLOAT) /12 AS months_difference
  FROM employee_3
), 
CTE_temp AS(
SELECT employee_no, 
    CASE WHEN months_difference < 1 THEN '< 1 Year'
         WHEN months_difference >=1 AND months_difference < 3 THEN '1-3 Year'
         WHEN months_difference > 3 THEN '3 + Year' END AS temp_difference 
    FROM CTE_difference 
)
SELECT temp_difference, COUNT(*) FROM CTE_temp group by temp_difference

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
2 rows affected.

[('1-3 Year', 1), ('3 + Year', 7)]

## List all employees whose work anniversary is the same as the birthday

In [10]:
%%sql SELECT *
FROM employee_3
WHERE EXTRACT(DAY FROM birth_date) = EXTRACT(DAY FROM joining_date)
  AND EXTRACT(MONTH FROM birth_date) = EXTRACT(MONTH FROM joining_date);

 * postgresql://postgres:***@localhost/my_base
   postgresql://postgres:***@localhost/sql_2
2 rows affected.

[(1003, datetime.date(1992, 2, 7), 'JOHN', 'Waugh', datetime.date(2016, 2, 7)),
 (1006, datetime.date(1994, 6, 23), 'ROBERT', 'PATRICA', datetime.date(2015, 6, 23))]